using System.Collections;
using System.Collections.Generic;
using UnityEngine;

// 메모하는 공간
/*
1월 31일 패스파인더, 히어로 스크립트 추가
유아이 마우스 입력받는법, 이미지 바꾸는법 공부할 것

    2월1일 UI, MenuScene 정리

    2월 2일 네비게이션매쉬, 드래그
    레이캐스트, 네이게이션 매쉬, Boolean, delegate

    2월 3일 씬전환, 버튼기능, 유닛+고블린 코드정리, 자원 증가

    2월 4일 박주성 -코드정리 고기혁 - 히어로 이미지, 히어로 스프라이트 체인지

    2월 6일 박주성- 유닛완성, 파이어볼, 숫자 유아이(Text), 히어로 덱설정,월드 설정
    고기혁 - 3d 맵, 3d asset, 화살표 유아이, 히어로 스크립트 완성, 2d 셋신완성

 스테이지정보, 덱정보, 영지, 건물짓기, 로고, 배경
     
    셋신버튼, 월드신버튼, 영웅 스킬, 메뉴 컨츄리 이미지, 로고, 스토리, 배경
    숫자 유아이, 샵씬, 콘퀘스트 버튼

    2월 8일 몬스터 어택과 HP깍는 속도가 안맞음

    many-Worlds
     */
